%% 作业六
% 3、根据以前所学所有知识设计关于多项式运算的题目2个，每个题目里面至少包括运算3个。

% 已知多项式 
% y1 = - 9*x^6 + 5*x^5 + 2*x^4 + 3*x^2 - 6*x + 5
% y2 = x^6 + 5*x^5 + 22*x^4 - 3*x^3 + 12*x + 23
% 计算 y3 = y1*y2 的导函数表达式并求出 y3'(5) 的值


close all;clear;clc;
y1 = [-9,5,2,0,3,-6,5];
y2 = [1,5,22,-3,0,12,23];
% Y1 = poly2sym(y1)
% Y2 = poly2sym(y2)
y3 = conv(y1,y2);           % 多项式相乘
Y3 = poly2sym(y3)           % 输出
dy3 = polyder(y1,y2);       % 相乘求导
dY3 = poly2sym(dy3)         % 输出
dy3_5 = polyval(dy3,5)      % dy3（5）


