% （15分）使用「不选主元的高斯消去法」求解线性方程组
% [■(0.001&2.000&3.000@-1.000&3.712&4.623@-2.000&1.072&5.643)]  [■(x_1@x_2@x_3 )]=[■(1.000@2.000@3.000)]
% 在误差限为10^14的情况下，验证其解的可靠性

% 不选主元素的高斯消去法
% 可在代码中修改增广炬阵Ab = [A b] 及误差限的值 WuChaXian
% 输出求解过程及解向量

close all;clear;clc
% A = [1,1,1; 0,4,-1; 2,-2,1];    % （测试用）系数矩阵
% b = [6;5;1];                    % （测试用）方程等号右侧的常数项矩阵
A = [0.001, 2.000, 3.000; -1.000, 3.712, 4.623;-2.000, 1.072, 5.643];
b = [1.000; 2.000; 3.000];
r = rank(A);                    % 矩阵求秩
R = rank([A b]);                % 增广矩阵求秩

WuChaXian = 1e-14;              % 设定误差限
[m,n] = size(A);                % 系数矩阵检验是否为方阵
if m ~= n
    error('矩阵应该是方阵');
end
nb = n+1;
Ab = [A b];
disp('————不选主元素的高斯消去法 - 消元过程————')
disp(Ab)        % 输出增广炬阵
% 消元过程
for i = 1:n-1
    pivot =  Ab(i,i);
    if abs(pivot)<WuChaXian
        error('对角线出现0元素');
    end
    for k = i+1:n
        Ab(k,i:nb) = Ab(k,i:nb)-(Ab(k,i)/pivot)*Ab(i,i:nb);
        disp(Ab)
    end
    % 回代过程
    x = zeros(n,1);
    x(n) = Ab(n,nb)/Ab(n,n);
    for i = n-1:-1:1
        x(i) = (Ab(i,nb)-Ab(i,i+1:n)*x(i+1:n))/Ab(i,i);
    end
end
disp('————方程组的解————')
x       % 输出方程的解