%% 小测五
% 1、自定义本课程95人的考试成绩中优、良、中、及格、不及格的人数【满足正态分布】
% 【图1~4】
% 1）用pie()、pie3()显示成绩比例并抽取不及格；
% 2）用pie()、pie3()绘图，抽取优良、标注【优，良，中，及格，不及格】

close all;clear;clc;
x = [15, 30, 35, 10, 5]; % 15+30+35+10+5 = 95
explode1 = [0, 0, 0, 0, 1]; % 抽取不及格

subplot(2,2,1)
pie(x,explode1);
title('用 pie() 显示成绩比例并抽取不及格')
subplot(2,2,2)
pie3(x,explode1); 
title('用 pie3() 显示成绩比例并抽取不及格')

explode2 = [1, 1, 0, 0, 0]; % 抽取优良
subplot(2,2,3)
pie(x,explode2,{'优','良','中','及格','不及格'});
title('用pie()绘图，抽取优良、标注')
subplot(2,2,4)
pie3(x,explode2,{'优','良','中','及格','不及格'});
title('用pie3()绘图，抽取优良、标注')

