%% 3、自己编写三个线性方程组，求解的方程组的解。
% 要求：1）从线性代数中抽调或自己编写3个线性方程组
% 2）求解线性方程组解的语句保存到*，m件；
% 3）线性方程组及解写入word。

% 2x1 – x2 – x3 + x4 = 1
% x1 + x2 – 2x3 + x4 = 1
% 4x1 - 6x2 + x3 - 3x4 = -15
% 3x1 + 6x2 – 9x3 + 6x4 = 12

close all; clear; clc;
A = [2, -1, -1, 1; 1, 1, -2, 1; 4, -6, 1, -3; 3, 6, -9, 6];
a = [1; 1; -15; 12];
disp('第一个方程的解：')
x = (A\a)'

% y1 + 2y2 + 3y3 = 9
% y1 - 2y2 + 3y3 = 6
% y1 + 2y2 - y3 = 3

B = [1,2,3;1,-2,3;1,2,-1];
b = [9;6;3];
disp('第二个方程的解：')
y = (B\b)'

% 5z1 + 2z2 + 3z3 = 9
% 4z1 +       5z3 = 6
%       8z2 + 9z3 = 3

D = [5,2,3; 4,0,5;0,8,9];
d = [9;6;3];
disp('第三个方程的解：')
z = (D\d)'
