%% 4、根据已学课程知识，自己编写题目并给出答案。
% 要求：1）包含矩阵关系运算符4个、逻辑运算2个；
% 2）矩阵的上三角矩阵、翻转、转向；
% 3）矩阵的逆、行列式、迹、秩、特征向量；
% 4）语句保存到*，m件；
% 5）要求及答案写入word。

% 题目：
% 已知矩阵A=[2,3,1;0,1,3;1,2,5]，B=[4,5,6;1,2,3;0,0,0]，分别进行A与B的相等运算，
% A大于5的关系运算，B小于4的关系运算，和A不等于5的关系运算；A与B、A或B的逻辑运算。
% 求矩阵的上三角矩阵、翻转、转向；求A矩阵的逆、行列式、迹、秩、特征向量.

close all; clear; clc;
% 矩阵关系运算符4个、逻辑运算2个；
A = [2,3,1;0,1,3;1,2,5];
B = [4,5,6;1,2,3;0,0,0];
A1 = A == B
A2 = A > 5
A3 = B < 4
A4 = A ~= 5
A5 = A & B
A6 = A | B
any(B<5)
d = [1;5;9]
e = [2,6,4]
D = all(d>2)
E = any(e<5)
% 矩阵的上三角矩阵、左右翻转、逆时针旋转九十度；
B
B1 = triu(B)
B2 = fliplr(B)
B3 = rot90(B)
B4 = rot90(B)
% 矩阵A的逆、行列式、迹、秩、特征向量；
A6 = inv(A)
A7 = det(A)
A8 = trace(A)
A9 = rank(A)
[V,D] = eig(A)


